In [1]:
import pandas as pd

## Dados absolutos

In [25]:
dados = {
    'emprego': ['dba', 'programador','arquiteto_redes'],
    'nova_jersey': [97350, 82000, 112840],
    'florida': [ 77140, 71540, 62310]
}

In [17]:
type(dados)

dict

In [18]:
dataset = pd.DataFrame(dados)

In [19]:
dataset.head()

           emprego  nova_jersey  florida
0              dba        97350    77140
1      programador        82000    71540
2  arquiteto_redes       112840    62310

In [20]:
dataset['nova_jersey'].sum()

292190

In [21]:
dataset['florida'].sum()

210990

In [22]:
dataset['%_nova_jersey'] = dataset['nova_jersey'] / dataset['nova_jersey'].sum()

In [23]:
dataset['%_florida'] = dataset['florida'] / dataset['florida'].sum()

In [24]:
dataset

           emprego  nova_jersey  florida  %_nova_jersey  %_florida
0              dba        97350    77140       0.333174   0.365610
1      programador        82000    71540       0.280639   0.339068
2  arquiteto_redes       112840    62310       0.386187   0.295322

## Dados relativos

In [26]:
dados2 = {
    'ano': ['1', '2', '3', '4', 'total'],
    'matriculas_marco': [70,50,47,23,190],
    'matriculas_novembro': [65,48,40,22,175]
}

In [29]:
dataset2 = pd.DataFrame(dados2)
dataset2

     ano  matriculas_marco  matriculas_novembro
0      1                70                   65
1      2                50                   48
2      3                47                   40
3      4                23                   22
4  total               190                  175

In [33]:
dataset2['taxa_evasao'] = (dataset2['matriculas_marco'] - dataset2['matriculas_novembro']) / dataset2['matriculas_marco'] * 100
dataset2

     ano  matriculas_marco  matriculas_novembro  taxa_evasao
0      1                70                   65     7.142857
1      2                50                   48     4.000000
2      3                47                   40    14.893617
3      4                23                   22     4.347826
4  total               190                  175     7.894737